#Week 07

Introducing Categorical Encoding:
Label Encoding & One Hot Encoding

What's Categorical Encoding?
Categorical Encoding is a proses converting categorial number to numerical number.
there's a lot of Categorical Enconding type,two of them is :
1.Label Encoding
2.One Hot Encoding

Refrence:https://en.wikipedia.org/wiki/One-hot

Label Encoding:
on Label Encoding,Each Category on a certain feature will sorted based on alphabetical order and represented with integer value.

Dataset:

In [1]:
import pandas as pd

df=pd.DataFrame({
    'country': ['India', 'Us', 'Japan', 'Us' , 'Japan'],
    'age':[44,34,46,35,23],
    'salary':[72000,65000,98000,45000,34000]
})

df

  country  age  salary
0   India   44   72000
1      Us   34   65000
2   Japan   46   98000
3      Us   35   45000
4   Japan   23   34000

Label Encoding on Scikit Learn

In [2]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [3]:
label_encoder.classes_

array(['India', 'Japan', 'Us'], dtype=object)

#One Hot Encoding

On One Hot Encoding each categories on certain feature sorted based on alphabetical order and represented as group of bits.

Dataset

In [4]:
df=pd.DataFrame({
    'country': ['India', 'Us', 'Japan', 'Us' , 'Japan'],
    'age':[44,34,46,35,23],
    'salary':[72000,65000,98000,45000,34000]
})

df

  country  age  salary
0   India   44   72000
1      Us   34   65000
2   Japan   46   98000
3      Us   35   45000
4   Japan   23   34000

One Hot Encoding on Scikit Learn

In [5]:
X = df['country'].values.reshape(-1,1)
X

array([['India'],
       ['Us'],
       ['Japan'],
       ['Us'],
       ['Japan']], dtype=object)

In [8]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
X= onehot_encoder.fit_transform(X).toarray()
X

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [9]:
onehot_encoder.categories_

[array(['India', 'Japan', 'Us'], dtype=object)]

In [10]:
df_onehot = pd.DataFrame(X, columns=[str(i) for i in range(X.shape[1])])
df_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [11]:
df = pd.concat([df_onehot, df], axis=1)
df

     0    1    2 country  age  salary
0  1.0  0.0  0.0   India   44   72000
1  0.0  0.0  1.0      Us   34   65000
2  0.0  1.0  0.0   Japan   46   98000
3  0.0  0.0  1.0      Us   35   45000
4  0.0  1.0  0.0   Japan   23   34000

In [12]:
df = df.drop(['country'], axis=1)

Label Encoding Vs One Hot Encoding

We Implement One Hot Encoding if:
categorial value is nominal,
not too many categories

We Implement Label Encoding if:
categorical values are ordinal,
relatively large number of categories